# markdown study

# 基本语法

## 1. 标题

使用#加空格表示标题，使用#加#加#...表示几级标题

## 2. 字体

使用 * 写斜体 *斜体*
使用 ** 写粗体 **粗体** 
使用 *** 写粗斜体 ***粗斜体***

## 3.线

使用 +++ 或 --- 或 *** 写分割线

***********

使用~~写删除线

~~删除~~

用<u>  和 </u>  写下划线

<u>下划线</u>

## 4. 列表

* 用*，+，-来标记无序列表

* 用数字.空格来表示有序列表
  1. 有序
  2. 有序

可以在这里使用嵌套

tab用于降级，shift+tab用于升级

## 5.区块

用>加空格表示区块

> 这是区块
>
> 区块也可以嵌套
>
> > 二级区块
> >
> > > 三级区块
> >
> >  

## 6. 代码

用一对 **`**（数字1旁边的符号）括住代码

`printf("Hello World!")`

可以用**三个 ` 加Enter/空格+编程语言**来表示

``` # include <stdio.h>
void main(){
	printf("Hello world!\n");
}
```

## 7.链接

用[] 加()

[wo](wojia)

或者直接<>

<www>

还可以用[] ()

打开本地文件

[readme](./readme.md)

还可以跳转文章内标题

[链接](##6. 代码)

可以加入图片地址

- 首先一个感叹号
- 然后中括号里面写属性文本
- 小括号里面写图片地址，后可接标题

用 `|` 来分隔不同的单元格，使用 `-` 来分隔表头和其他行



